{"config": [{"config": {"trainable": true, "padding": "valid", "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 2, 500], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_first", "kernel_size": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 16, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_first", "kernel_size": [1, 1], "filters": 16, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_first", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 128, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 5, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}
