{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "batch_input_shape": [null, 1, 2, 500], "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [1, 1], "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "filters": 8, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_first", "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "filters": 8, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_first", "padding": "valid", "trainable": true, "pool_size": [1, 1], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "units": 128, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "units": 5, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null}}]}