{"config": [{"config": {"name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "batch_input_shape": [null, 1, 2, 500], "padding": "valid", "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "filters": 8, "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "padding": "valid", "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_size": [1, 1], "filters": 8, "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_first", "pool_size": [1, 1], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "units": 128}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "trainable": true, "units": 5}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}