{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 1, 2, 500], "trainable": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 8, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "name": "max_pooling2d_1", "strides": [1, 1], "pool_size": [1, 1], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}]}