{"backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 8, "kernel_regularizer": null, "batch_input_shape": [null, 1, 2, 500], "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "data_format": "channels_first", "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "kernel_size": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "padding": "valid", "pool_size": [1, 1], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "units": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "units": 5, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_2", "activity_regularizer": null, "activation": "softmax"}}]}