{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_1", "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 2, 500], "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_first", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "data_format": "channels_first", "padding": "valid", "name": "conv2d_2", "bias_constraint": null, "activity_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [1, 1], "data_format": "channels_first", "pool_size": [1, 1], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "units": 128, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "units": 5, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true}}]}