{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "padding": "valid", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "batch_input_shape": [null, 1, 2, 500], "bias_constraint": null, "activation": "relu", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "padding": "valid", "activity_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "name": "conv2d_2", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_first", "padding": "valid", "pool_size": [1, 1], "strides": [1, 1], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "units": 128, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_2", "units": 5, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}]}