{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_1", "bias_regularizer": null, "filters": 8, "dtype": "float32", "data_format": "channels_first", "padding": "valid", "kernel_size": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "batch_input_shape": [null, 1, 2, 500], "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_2", "bias_constraint": null, "filters": 8, "data_format": "channels_first", "padding": "valid", "kernel_size": [1, 1], "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 1], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_first", "strides": [1, 1], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}]}