{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_1", "filters": 8, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 2, 500], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_2", "filters": 8, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [1, 1], "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [1, 1], "data_format": "channels_first", "padding": "valid", "trainable": true, "pool_size": [1, 1]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activation": "softmax", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}]}