{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_size": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "dtype": "float32", "name": "conv2d_1", "padding": "valid", "kernel_constraint": null, "batch_input_shape": [null, 1, 2, 500], "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "filters": 8}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "data_format": "channels_first", "kernel_size": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "name": "conv2d_2", "strides": [1, 1], "bias_regularizer": null, "filters": 8}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [1, 1], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 128}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "units": 5}}]}