{"config": [{"config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "batch_input_shape": [null, 1, 2, 500], "kernel_size": [2, 2], "filters": 8, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "name": "conv2d_2", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "kernel_size": [1, 1], "filters": 8, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [1, 1], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}