{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 16, "activation": "relu", "kernel_size": [1, 1], "dtype": "float32", "strides": [1, 1], "batch_input_shape": [null, 1, 2, 500], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "valid", "data_format": "channels_first", "bias_constraint": null, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "filters": 16, "activation": "relu", "kernel_size": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 128, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "dense_1", "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 5, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "dense_2", "activation": "softmax", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}], "backend": "tensorflow"}