{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 2, 500], "kernel_regularizer": null, "name": "conv2d_1", "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "filters": 8, "activation": "relu", "strides": [1, 1], "padding": "valid", "dtype": "float32", "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "filters": 8, "activation": "relu", "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 128, "activation": "relu", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 5, "activation": "softmax", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}]}