{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"activation": "relu", "kernel_size": [1, 1], "trainable": true, "batch_input_shape": [null, 1, 2, 500], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_first", "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "filters": 16, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "dtype": "float32", "bias_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_first", "activity_regularizer": null, "name": "conv2d_2", "filters": 16, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}