{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "batch_input_shape": [null, 1, 2, 500], "filters": 16, "kernel_size": [1, 1], "data_format": "channels_first", "dtype": "float32", "name": "conv2d_1", "padding": "valid", "use_bias": true, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_size": [1, 1], "data_format": "channels_first", "use_bias": true, "name": "conv2d_2", "padding": "valid", "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 128, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 5, "use_bias": true, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}]}