{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 1, 2, 500], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "padding": "valid", "filters": 16}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "filters": 16}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}