{"config": [{"config": {"trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [1, 1], "dtype": "float32", "batch_input_shape": [null, 1, 2, 500], "padding": "valid", "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 16, "name": "conv2d_1", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [1, 1], "padding": "valid", "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 16, "name": "conv2d_2", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "units": 128}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "units": 5}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}