{"config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "strides": [1, 1], "batch_input_shape": [null, 1, 2, 500], "kernel_constraint": null, "padding": "valid", "use_bias": true, "trainable": true, "name": "conv2d_1", "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "filters": 16, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "padding": "valid", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "filters": 16, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "units": 128, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "units": 5, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}